[
  {
    "tag": "p",
    "text": "Nathan Zimmerman"
  },
  {
    "tag": "p",
    "text": "Raritan, NJ"
  },
  {
    "tag": "p",
    "text": "nathan.a.zimmerman@gmail.com"
  },
  {
    "tag": "p",
    "text": "610.955.6578"
  },
  {
    "tag": "p",
    "text": "nathanzimmerman.com"
  },
  {
    "tag": "p",
    "text": "LinkedIn"
  },
  {
    "tag": "p",
    "text": "GitHub"
  },
  {
    "tag": "p",
    "text": "WORK HISTORY"
  },
  {
    "tag": "p",
    "text": "Software Engineer II, Nelnet\t10/2023 – Present"
  },
  {
    "tag": "ul",
    "text": "Contributed to a greenfield Payment Plans & Billing domain for a multi-tenant SaaS platform.Built a payment plan schedule calculator in PaymentPlanEnrollment. Generated valid installment scenarios based on first-installment constraints, installment count, down payment, frequency (weekly/monthly), and completion date; wired results to an interactive Angular UI (sliders/inputs).Packaged the calculator UI as an npm package and integrated it into PaymentPlans for admin preview via an interactive (read-only) MatDialog so admins can validate configurations against the consumer enrollment flow. Implemented runtime payment plan status calculation computed on-the-fly from persisted confirmation/start/end timestamps to keep UI state accurate without storing status in the database.Improved data quality by expanding FluentValidation rules and adding unit/integration tests (xUnit/Moq)."
  },
  {
    "tag": "p",
    "text": "Software Development Engineer, Amazon\t05/2022 – 04/2023"
  },
  {
    "tag": "ul",
    "text": "Engineered risk guidance applications using Java, Scala, Spring, and AWS to screen third-party sellers against denied party lists, predicting financial offenses such as money laundering.Remediated critical security issues by enabling encryption (SQS/SNS/S3 via KMS), tightening IAM policies to least privilege, and upgrading dependencies to address vulnerabilities.Performed EC2 host migrations across IAD/PDX Availability Zones for 10+ applications and 100+ environments, validating cutovers with alarms/dashboards to ensure zero downtime.Reduced support ticket volume by resolving pipeline failures, monitoring alarms, and fixing deployment errors."
  },
  {
    "tag": "p",
    "text": "Software Developer, Radian Group Inc.\t09/2019 – 04/2022"
  },
  {
    "tag": "ul",
    "text": "Contributed to launch and maintenance of “MyRadian,” a React + Node.js suite for Valuation and Asset Management Services, supporting feature delivery through code reviews, bug fixes, and production support.Troubleshot production issues and improved performance using AWS (CloudWatch, X-Ray, DynamoDB); maintained legacy C#/.NET and Java apps, resolving customer issues with Splunk and SQL.Automated database reconciliation workflows with Python scripts, eliminating manual daily effort."
  },
  {
    "tag": "p",
    "text": "PROJECTS"
  },
  {
    "tag": "ul",
    "text": "Sudoku ( sudoku.nathanzimmerman.com ) - Built a full-stack Sudoku app with a .NET Web API puzzle generator and Angular gameplay UI. Added validation, rate limiting, and CI-backed tests to keep gameplay reliable.Blackjack ( blackjack.nathanzimmerman.com ) - Built a session-backed Blackjack game with Spring Boot + Spring Security and a React UI. Implemented rules (splits, insurance) plus validation and security hardening.Nerdle ( nerdle.nathanzimmerman.com  ) – Built a Wordle-style game with a Node/Express backend that validates guesses server-side. Added rate limiting, theming, and stats tracking.Brick Breaker Resume ( resume.nathanzimmerman.com )– Built a Phaser game that parses a live .docx resume to generate levels from text. Implemented mapping logic, responsive scaling, and score persistence."
  },
  {
    "tag": "p",
    "text": "SKILLS"
  },
  {
    "tag": "ul",
    "text": "HTML, CSS, JavaScript, Angular, React, Java, Node.js, C#, .NET, MongoDB, Azure, AWS, REST API, Git"
  },
  {
    "tag": "p",
    "text": "EDUCATION"
  },
  {
    "tag": "p",
    "text": "AS, Computer Science, Delaware County Community College, 2018, GPA 3.89"
  },
  {
    "tag": "p",
    "text": "BA, Psychology, (History minor), Rutgers University School of Arts and Sciences, 2016"
  }
]